eisup_2019_docmng_integration/src/Catalogs/РегистрацияВИФНС/РегистрацияВИФНС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрацияВИФНС</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>КПП</name>
    <comment>Код причины постановки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <comment>Представитель в территориальном органе ФНС</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПредставителя</name>
    <comment>Название документа, подтверждающего полномочия представителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченноеЛицоПредставителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Доверенность</name>
    <comment>Доверенность налогоплательщика на представителя</comment>
    <type>
      <types>CatalogRef.ДоверенностиНалогоплательщика</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НаименованиеОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДолжностьОтветственногоЛица</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/РегистрацияВИФНС/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	флЭтоПБОЮЛ = РегламентированнаяОтчетность.ЭтоПБОЮЛ(Владелец);
	
	Если ПустаяСтрока(Код) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не задан код налогового органа.", Отказ);
	ИначеЕсли СтрДлина(СокрЛП(Код)) <> 4 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Код налогового органа должен состоять из 4 символов.", Отказ);
	КонецЕсли;
	
	Если НЕ флЭтоПБОЮЛ Тогда
		Если ПустаяСтрока(КПП) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен КПП.", Отказ);
		ИначеЕсли СтрДлина(СокрЛП(КПП)) <> 9 Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("КПП должен состоять из 9 символов.", Отказ);
		КонецЕсли;
	Иначе
	    //для ПБОЮЛ очищаем КПП
		КПП = "";
	КонецЕсли;
	
	СуществующаяЗапись = РегламентированнаяОтчетность.ПолучитьПоКодамРегистрациюВИФНС(Владелец, Код, КПП);
	
	Если СуществующаяЗапись <> Неопределено И СуществующаяЗапись <> Ссылка Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Для данной организации уже существует запись с указанными кодом налогового органа" 
		+ ?(флЭтоПБОЮЛ, ".", " и КПП."), Отказ);
	КонецЕсли; 
		
	Если ПустаяСтрока(НаименованиеИФНС) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено полное наименование налогового органа.", Отказ);
	Конецесли;

	Если ЗначениеЗаполнено(Представитель) И ПустаяСтрока(ДокументПредставителя) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не задан документ, подтверждающий полномочия представителя.", Отказ);
	КонецЕсли;
		
	Если НЕ Отказ Тогда
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = НаименованиеИФНС;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Представитель) Тогда
			ДокументПредставителя = "";
			УполномоченноеЛицоПредставителя = "";
		ИначеЕсли Метаданные.Справочники.Найти("ФизическиеЛица") <> Неопределено И ТипЗнч(Представитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			УполномоченноеЛицоПредставителя = "";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
